import json
# Temp ={"智能合板":{"无任务":{"刷新按钮":"步骤描述"},"H22":22,"H23":{"H31":1}}}
# Temp2 ={"智能合板":{"无任务":{"刷新按钮":"步骤描述"},"H221":22,"H23":{"H311":1}}}
# Temp3 = {"fei":23}
#
# list = [
#     {"智能合板":{"无任务":{"刷新按钮":["步骤描述"]},"H22":[22],"H23":{"H31":[1]}}},
#     {"智能合板":{"无任务":{"刷新按钮":["步骤描述"]},"H221":[22],"H23":{"H311":[1]}}},
#     {"fei":[23]}
# ]

l = [
    {"a": {"b": {"c": {"d": ["ab"]}}}},
    {"a": {"b": {"d": ["aa"]}}},
    {"a": {"f": {"c": ["xx"]}}},
    {"a": {"b": {"c": {"d": ["ef"]}}}}
]
o = {}
for d in l:
    n = o
    m = d
    p = None
    while isinstance(m, dict):
        if p is not None:
            if k not in p:
                p[k] = {}
            n = p[k]
        (k, m), = m.items()
        p = n
    p.setdefault(k, []).extend(m)
print(o)